In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series(['A','B','C','bhello','123',np.nan,'hj'])

In [3]:
df=pd.DataFrame({
    'key':list('fjsakf'),
    'key2':['hee','fv','w','hija','123',np.nan]
})

In [4]:
s

0         A
1         B
2         C
3    bhello
4       123
5       NaN
6        hj
dtype: object

In [5]:
df

  key  key2
0   f   hee
1   j    fv
2   s     w
3   a  hija
4   k   123
5   f   NaN

In [6]:
print(s.str.count('b'))

0    0.0
1    0.0
2    0.0
3    1.0
4    0.0
5    NaN
6    0.0
dtype: float64

In [7]:
print(df['key2'].str.upper())

0     HEE
1      FV
2       W
3    HIJA
4     123
5     NaN
Name: key2, dtype: object

In [8]:
df.columns=df.columns.str.upper()

In [9]:
df

  KEY  KEY2
0   f   hee
1   j    fv
2   s     w
3   a  hija
4   k   123
5   f   NaN

In [10]:
print(s.str.lower())

0         a
1         b
2         c
3    bhello
4       123
5       NaN
6        hj
dtype: object

In [11]:
s

0         A
1         B
2         C
3    bhello
4       123
5       NaN
6        hj
dtype: object

In [12]:
print(s.str.upper())

0         A
1         B
2         C
3    BHELLO
4       123
5       NaN
6        HJ
dtype: object

In [13]:
print(s.str.len())

0    1.0
1    1.0
2    1.0
3    6.0
4    3.0
5    NaN
6    2.0
dtype: float64

In [14]:
print(s.str.startswith('b'))

0    False
1    False
2    False
3     True
4    False
5      NaN
6    False
dtype: object

In [15]:
print(s.str.endswith('3'))

0    False
1    False
2    False
3    False
4     True
5      NaN
6    False
dtype: object

In [16]:
s

0         A
1         B
2         C
3    bhello
4       123
5       NaN
6        hj
dtype: object

In [17]:
sBlank=pd.Series(['  jack',' jill  ','  jesse   ',' frank'])

In [18]:
dfBlank=pd.DataFrame(np.random.randn(3,2),columns=[' columns A',' columns B   '],index=range(3))

In [19]:
dfBlank

    columns A   columns B
0   -1.440767      -0.138380
1    1.151322       1.655090
2    0.262315       0.715136

In [20]:
print(sBlank.str.strip())

0     jack
1     jill
2    jesse
3    frank
dtype: object

In [21]:
print(sBlank.str.lstrip())

0        jack
1      jill
2    jesse
3       frank
dtype: object

In [22]:
print(sBlank.str.rstrip())

0       jack
1       jill
2      jesse
3      frank
dtype: object

In [23]:
dfBlank.columns=dfBlank.columns.str.replace(' ' ,'-')

In [24]:
dfBlank

   -columns-A  -columns-B---
0   -1.440767      -0.138380
1    1.151322       1.655090
2    0.262315       0.715136

In [25]:
dfBlank.columns=dfBlank.columns.str.strip()

In [26]:
dfBlank

   -columns-A  -columns-B---
0   -1.440767      -0.138380
1    1.151322       1.655090
2    0.262315       0.715136

In [27]:
dfBlank

   -columns-A  -columns-B---
0   -1.440767      -0.138380
1    1.151322       1.655090
2    0.262315       0.715136

In [28]:
splitS=pd.Series(['a,b,c','1,2,3',['a...c'],np.nan])

In [29]:
splitS

0      a,b,c
1      1,2,3
2    [a...c]
3        NaN
dtype: object

In [37]:
print(splitS.str.split(',').str[0])

0      a
1      1
2    NaN
3    NaN
dtype: object

In [36]:
print(splitS.str.split(',',expand=True))

     0    1    2
0    a    b    c
1    1    2    3
2  NaN  NaN  NaN
3  NaN  NaN  NaN

In [41]:
dfSpliter=pd.DataFrame({
    'key1':['a,b,c','1,2,3',[':,., ']],
    'key2':['a-b-c','1-2-3',[':-.- ']]
})

In [42]:
dfSpliter

      key1     key2
0    a,b,c    a-b-c
1    1,2,3    1-2-3
2  [:,., ]  [:-.- ]

In [43]:
dfSpliter['k201']=dfSpliter['key2'].str.split('-').str[0]

In [44]:
dfSpliter

      key1     key2 k201
0    a,b,c    a-b-c    a
1    1,2,3    1-2-3    1
2  [:,., ]  [:-.- ]  NaN

In [45]:
dfSpliter['k202']=dfSpliter['key2'].str.split('-').str[1]

In [46]:
dfSpliter

      key1     key2 k201 k202
0    a,b,c    a-b-c    a    b
1    1,2,3    1-2-3    1    2
2  [:,., ]  [:-.- ]  NaN  NaN

In [47]:
dfSpliter['k203']=dfSpliter['key2'].str.split('-').str[2]

In [48]:
dfSpliter

      key1     key2 k201 k202 k203
0    a,b,c    a-b-c    a    b    c
1    1,2,3    1-2-3    1    2    3
2  [:,., ]  [:-.- ]  NaN  NaN  NaN